In [66]:
import sqlite3 as sql
import pandas as pd

In [67]:
conn = sql.connect('database_Students.sqlite')
conn

In [68]:
##pd.read_sql_query("select * from Salaries", conn)

In [69]:
def sql_query(q):
    return pd.read_sql_query(q,conn)

In [151]:
q= '''drop table student; '''
conn.execute(q)
conn.commit()

#### Create Command

In [152]:
q= '''CREATE TABLE student (
      ID char(5) Primary Key, 
      name varchar(20) NOT NULL, 
      dept_name varchar(20) NOT NULL, 
      Age numeric(8) NOT NULL
)
   '''
conn.execute(q)
conn.commit()

In [153]:
q= '''SELECT name FROM sqlite_master'''
sql_query(q)

                         name
0                     student
1  sqlite_autoindex_student_1

In [154]:
q= '''SELECT name FROM sqlite_master where type = "table"'''
sql_query(q)

      name
0  student

In [155]:
q= '''SELECT * from student '''
sql_query(q)

Empty DataFrame
Columns: [ID, name, dept_name, Age]
Index: []

#### Alter

In [156]:
q= '''ALTER TABLE student
ADD COLUMN fathername VARCHAR(10) NOT NULL;
  '''
conn.execute(q)
conn.commit()

In [157]:
q= '''SELECT * from student '''
sql_query(q)

Empty DataFrame
Columns: [ID, name, dept_name, Age, fathername]
Index: []

#### INSERT

In [158]:
q= '''INSERT INTO student (ID, name, dept_name ,age, fathername)
VALUES ('B', 'Alice', 'CS', 24 , "Ahmed");'''
conn.execute(q)
conn.commit()

In [159]:
q= '''SELECT * from student '''
sql_query(q)

  ID   name dept_name  Age fathername
0  B  Alice        CS   24      Ahmed

In [160]:
q= '''INSERT INTO student (ID, name, dept_name ,age, fathername)
VALUES ('sfg', 'Anis', 'CS', 19 , "XYZ"),
       ('A', 'Fizza', 'CS', 21 , "XYZ"),
       ('cde', 'Dua', 'CS', 22 , "XYZ"),
       ('fgh', 'priya', 'CS', 23 , "XYZ");
       '''
conn.execute(q)
conn.commit()

In [161]:
q= '''SELECT * from student '''
sql_query(q)

    ID   name dept_name  Age fathername
0    B  Alice        CS   24      Ahmed
1  sfg   Anis        CS   19        XYZ
2    A  Fizza        CS   21        XYZ
3  cde    Dua        CS   22        XYZ
4  fgh  priya        CS   23        XYZ

In [162]:
q= '''INSERT INTO student VALUES ('sdw', 'Maleeka', 'CS', 29 , "XYZ");
       '''
conn.execute(q)
conn.commit()

In [163]:
q= '''SELECT * from student '''
sql_query(q)

    ID     name dept_name  Age fathername
0    B    Alice        CS   24      Ahmed
1  sfg     Anis        CS   19        XYZ
2    A    Fizza        CS   21        XYZ
3  cde      Dua        CS   22        XYZ
4  fgh    priya        CS   23        XYZ
5  sdw  Maleeka        CS   29        XYZ

In [164]:
q= '''INSERT INTO student VALUES ('sdw', 'Maleeka', 'CS' , "XYZ");
       '''
conn.execute(q)
conn.commit()

OperationalError: table student has 5 columns but 4 values were supplied

### Rename Table

In [165]:
q= '''ALTER TABLE student RENAME Column name TO First_name;
       '''
conn.execute(q)
conn.commit()

In [166]:
q= '''SELECT * from student '''
sql_query(q)

    ID First_name dept_name  Age fathername
0    B      Alice        CS   24      Ahmed
1  sfg       Anis        CS   19        XYZ
2    A      Fizza        CS   21        XYZ
3  cde        Dua        CS   22        XYZ
4  fgh      priya        CS   23        XYZ
5  sdw    Maleeka        CS   29        XYZ

In [167]:
q= '''ALTER TABLE student RENAME TO student_detail
       '''
conn.execute(q)
conn.commit()

In [168]:
q= '''SELECT * from student '''
sql_query(q)

DatabaseError: Execution failed on sql 'SELECT * from student ': no such table: student

In [169]:
q= '''SELECT * from student_detail
'''
sql_query(q)

    ID First_name dept_name  Age fathername
0    B      Alice        CS   24      Ahmed
1  sfg       Anis        CS   19        XYZ
2    A      Fizza        CS   21        XYZ
3  cde        Dua        CS   22        XYZ
4  fgh      priya        CS   23        XYZ
5  sdw    Maleeka        CS   29        XYZ

In [170]:
q= '''SELECT name FROM sqlite_master where type = "table"'''
sql_query(q)

             name
0  student_detail

In [186]:
q= '''Delete from student_detail'''
conn.execute(q)

In [187]:
q= '''SELECT * from student_detail
'''
sql_query(q)

Empty DataFrame
Columns: [ID, First_name, dept_name, Age, fathername]
Index: []

In [189]:
q= '''Drop table student_detail'''
conn.execute(q)

In [190]:
q= '''SELECT name FROM sqlite_master where type = "table"'''
sql_query(q)

Empty DataFrame
Columns: [name]
Index: []

#  DML  (Insert, update delete, modify)

In [191]:
q= '''CREATE TABLE Persons (
      P_ID char(5) Primary Key, 
      Name varchar(20) NOT NULL, 
      Degree char(20) NOT NULL, 
      weight numeric(3,2) NOT NULL
);
   '''
conn.execute(q)
conn.commit()

In [192]:
q= '''SELECT name FROM sqlite_master where type = "table"'''
sql_query(q)

      name
0  Persons

In [193]:
q = '''  INSERT INTO Persons (P_ID, Name, Degree, weight) VALUES
('P001', 'Alice', 'BSc', 55.30),
('P002', 'Bob', 'MSc', 70.40),
('P003', 'Charlie', 'PhD', 80.25),
('P004', 'David', 'BSc', 65.10),
('P005', 'Eva', 'MSc', 60.85);
'''
conn.execute(q)
conn.commit()

In [194]:
q = ''' select * from persons'''
sql_query(q)

   P_ID     Name Degree  weight
0  P001    Alice    BSc   55.30
1  P002      Bob    MSc   70.40
2  P003  Charlie    PhD   80.25
3  P004    David    BSc   65.10
4  P005      Eva    MSc   60.85

In [215]:
q = ''' Update persons 
        set Name = 'sapna' where P_ID= 'P001'
'''
conn.execute(q)
conn.commit()

In [216]:
q = ''' select * from persons'''
sql_query(q)

   P_ID     Name Degree  weight
0  P001    sapna    BSc   55.30
1  P002      Bob    MSc   70.40
2  P003  Charlie    PhD   80.25
3  P004    David    BSc   65.10
4  P005      Eva    MSc   60.85

In [227]:
q = ''' Update persons 
        set Name = ' kawita' where P_ID= 'P003' and Degree= "PhD"
'''
conn.execute(q)

In [230]:
q = ''' select * from persons'''
sql_query(q)

   P_ID     Name Degree  weight
0  P001    sapna    BSc   55.30
1  P002      Bob    MSc   70.40
2  P003   kawita    PhD   80.25
3  P004    David    BSc   65.10
4  P005      Eva    MSc   60.85

In [225]:
q = ''' Delete From persons where P_ID= 'P005'
'''
conn.execute(q)

In [226]:
q = ''' select * from persons'''
sql_query(q)

   P_ID     Name Degree  weight
0  P001    sapna    BSc   55.30
1  P002      Bob    MSc   70.40
2  P003   kawita    PhD   80.25
3  P004    David    BSc   65.10

In [231]:
q = ''' Alter table persons drop column weight '''   ###DDL command
conn.execute(q)

In [232]:
q = ''' select * from persons'''
sql_query(q)

   P_ID     Name Degree
0  P001    sapna    BSc
1  P002      Bob    MSc
2  P003   kawita    PhD
3  P004    David    BSc
4  P005      Eva    MSc